In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv('fakedata.csv', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   steak   30     165    4.6
Niko         TX  green    lamb    2      70    8.3
Aaron        FL    red   mango   12     120    9.0
Penelope     AL  white   apple    4      80    3.3
Dean         AK   gray  cheese   32     180    1.8
Christina    TX  black   melon   33     172    9.5
Cornelia     TX    red   beans   69     150    2.2

# Data types of the components
Let’s output the type of each component to understand exactly what kind of object they are.

In [2]:
index = df.index
columns = df.columns
values = df.values
index

Index(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'], dtype='object')

In [3]:
columns

Index(['state', 'color', 'food', 'age', 'height', 'score'], dtype='object')

In [4]:
values

array([['NY', 'blue', 'steak', 30, 165, 4.6],
       ['TX', 'green', 'lamb', 2, 70, 8.3],
       ['FL', 'red', 'mango', 12, 120, 9.0],
       ['AL', 'white', 'apple', 4, 80, 3.3],
       ['AK', 'gray', 'cheese', 32, 180, 1.8],
       ['TX', 'black', 'melon', 33, 172, 9.5],
       ['TX', 'red', 'beans', 69, 150, 2.2]], dtype=object)

In [5]:
type(index)

pandas.core.indexes.base.Index

In [6]:
type(columns)

pandas.core.indexes.base.Index

In [7]:
type(values)

numpy.ndarray

# Understanding these types
Interestingly, both the index and the columns are the same type. They are both a pandas Index object. This object is quite powerful in itself, but for now you can just think of it as a sequence of labels for either the rows or the columns.
The values are a NumPy ndarray, which stands for n-dimensional array, and is the primary container of data in the NumPy library. Pandas is built directly on top of NumPy and it's this array that is responsible for the bulk of the workload.

In [8]:
df['food']

Jane          steak
Niko           lamb
Aaron         mango
Penelope      apple
Dean         cheese
Christina     melon
Cornelia      beans
Name: food, dtype: object

In [9]:
df[['color', 'food', 'score']]

           color    food  score
Jane        blue   steak    4.6
Niko       green    lamb    8.3
Aaron        red   mango    9.0
Penelope   white   apple    3.3
Dean        gray  cheese    1.8
Christina  black   melon    9.5
Cornelia     red   beans    2.2

In [10]:
df[['height', 'color']]

           height  color
Jane          165   blue
Niko           70  green
Aaron         120    red
Penelope       80  white
Dean          180   gray
Christina     172  black
Cornelia      150    red

In [11]:
df.loc['Niko']

state        TX
color     green
food       lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

In [14]:
df.loc[['Niko', 'Penelope']]

         state  color   food  age  height  score
Niko        TX  green   lamb    2      70    8.3
Penelope    AL  white  apple    4      80    3.3

In [15]:
df.loc['Niko':'Dean']

         state  color    food  age  height  score
Niko        TX  green    lamb    2      70    8.3
Aaron       FL    red   mango   12     120    9.0
Penelope    AL  white   apple    4      80    3.3
Dean        AK   gray  cheese   32     180    1.8

In [16]:
df.loc[:'Aaron']

      state  color   food  age  height  score
Jane     NY   blue  steak   30     165    4.6
Niko     TX  green   lamb    2      70    8.3
Aaron    FL    red  mango   12     120    9.0

In [17]:
df.loc['Niko':'Christina':2]

          state  color   food  age  height  score
Niko         TX  green   lamb    2      70    8.3
Penelope     AL  white  apple    4      80    3.3
Christina    TX  black  melon   33     172    9.5

In [18]:
df.loc['Dean':]

          state  color    food  age  height  score
Dean         AK   gray  cheese   32     180    1.8
Christina    TX  black   melon   33     172    9.5
Cornelia     TX    red   beans   69     150    2.2

In [20]:
df.loc[['Dean', 'Cornelia'], ['age', 'state', 'score']]

          age state  score
Dean       32    AK    1.8
Cornelia   69    TX    2.2

In [21]:
df.loc[['Dean', 'Aaron'], 'food']

Dean     cheese
Aaron     mango
Name: food, dtype: object

In [22]:
df.loc['Jane':'Penelope', ['state', 'color']]

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

In [23]:
df.loc['Jane', 'age']

30

In [24]:
df.loc[:'Dean', 'height':]

          height  score
Jane         165    4.6
Niko          70    8.3
Aaron        120    9.0
Penelope      80    3.3
Dean         180    1.8

In [25]:
df.loc[:, ['food', 'color']]

             food  color
Jane        steak   blue
Niko         lamb  green
Aaron       mango    red
Penelope    apple  white
Dean       cheese   gray
Christina   melon  black
Cornelia    beans    red

In [26]:
df.loc[['Penelope','Cornelia'], :]

         state  color   food  age  height  score
Penelope    AL  white  apple    4      80    3.3
Cornelia    TX    red  beans   69     150    2.2

In [30]:
rows = ['Jane', 'Niko', 'Dean', 'Penelope', 'Christina']
cols = ['state', 'age', 'height', 'score']
df.loc[rows, cols]

          state  age  height  score
Jane         NY   30     165    4.6
Niko         TX    2      70    8.3
Dean         AK   32     180    1.8
Penelope     AL    4      80    3.3
Christina    TX   33     172    9.5

In [31]:
df.iloc[3]

state        AL
color     white
food      apple
age           4
height       80
score       3.3
Name: Penelope, dtype: object

In [32]:
df.iloc[[5, 2, 4]]

          state  color    food  age  height  score
Christina    TX  black   melon   33     172    9.5
Aaron        FL    red   mango   12     120    9.0
Dean         AK   gray  cheese   32     180    1.8

In [33]:
df.iloc[3:5]

         state  color    food  age  height  score
Penelope    AL  white   apple    4      80    3.3
Dean        AK   gray  cheese   32     180    1.8

In [34]:
df.iloc[3:]

          state  color    food  age  height  score
Penelope     AL  white   apple    4      80    3.3
Dean         AK   gray  cheese   32     180    1.8
Christina    TX  black   melon   33     172    9.5
Cornelia     TX    red   beans   69     150    2.2

In [35]:
df.iloc[3::2]

          state  color   food  age  height  score
Penelope     AL  white  apple    4      80    3.3
Christina    TX  black  melon   33     172    9.5

In [36]:
df.iloc[[2,3], [0, 4]]

         state  height
Aaron       FL     120
Penelope    AL      80

In [37]:
df.iloc[3:6, [1, 4]]

           color  height
Penelope   white      80
Dean        gray     180
Christina  black     172

In [38]:
df.iloc[2:5, 2:5]

            food  age  height
Aaron      mango   12     120
Penelope   apple    4      80
Dean      cheese   32     180

In [39]:
df.iloc[0, 2]

'steak'

In [40]:
df.iloc[:, 5]

Jane         4.6
Niko         8.3
Aaron        9.0
Penelope     3.3
Dean         1.8
Christina    9.5
Cornelia     2.2
Name: score, dtype: float64

In [41]:
food = df['food']
food

Jane          steak
Niko           lamb
Aaron         mango
Penelope      apple
Dean         cheese
Christina     melon
Cornelia      beans
Name: food, dtype: object

In [42]:
food.loc['Aaron']

'mango'

In [43]:
food.loc[['Dean', 'Niko', 'Cornelia']]

Dean        cheese
Niko          lamb
Cornelia     beans
Name: food, dtype: object

In [44]:
food.loc['Niko':'Christina']

Niko           lamb
Aaron         mango
Penelope      apple
Dean         cheese
Christina     melon
Name: food, dtype: object

In [45]:
food.loc['Penelope':]

Penelope      apple
Dean         cheese
Christina     melon
Cornelia      beans
Name: food, dtype: object

In [46]:
food.loc[['Aaron']]

Aaron    mango
Name: food, dtype: object

In [47]:
food.iloc[0]

'steak'

In [48]:
food.iloc[[4, 1, 3]]

Dean        cheese
Niko          lamb
Penelope     apple
Name: food, dtype: object

In [49]:
food.iloc[4:6]

Dean         cheese
Christina     melon
Name: food, dtype: object

In [54]:
df.loc['Jane':'Penelope', ['state', 'color']]

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

In [56]:
df.loc[:'Dean', 'height':]

          height  score
Jane         165    4.6
Niko          70    8.3
Aaron        120    9.0
Penelope      80    3.3
Dean         180    1.8

In [57]:
df.loc[:, ['food', 'color']]

             food  color
Jane        steak   blue
Niko         lamb  green
Aaron       mango    red
Penelope    apple  white
Dean       cheese   gray
Christina   melon  black
Cornelia    beans    red

In [58]:
df.loc[['Penelope','Cornelia'], :]

         state  color   food  age  height  score
Penelope    AL  white  apple    4      80    3.3
Cornelia    TX    red  beans   69     150    2.2

In [61]:
 rows = ['Jane', 'Niko', 'Dean', 'Penelope', 'Christina']
cols = ['state', 'age', 'height', 'score'] 
df.loc[rows, cols]

          state  age  height  score
Jane         NY   30     165    4.6
Niko         TX    2      70    8.3
Dean         AK   32     180    1.8
Penelope     AL    4      80    3.3
Christina    TX   33     172    9.5

In [62]:
df.iloc[3]

state        AL
color     white
food      apple
age           4
height       80
score       3.3
Name: Penelope, dtype: object

In [63]:

df.iloc[[5, 2, 4]] # remember, don't do df.iloc[5, 2, 4]

          state  color    food  age  height  score
Christina    TX  black   melon   33     172    9.5
Aaron        FL    red   mango   12     120    9.0
Dean         AK   gray  cheese   32     180    1.8

In [64]:
df.iloc[3:5]

         state  color    food  age  height  score
Penelope    AL  white   apple    4      80    3.3
Dean        AK   gray  cheese   32     180    1.8

In [65]:
df.iloc[[2,3], [0, 4]]

         state  height
Aaron       FL     120
Penelope    AL      80

In [66]:
df.iloc[3:6, [1, 4]]

           color  height
Penelope   white      80
Dean        gray     180
Christina  black     172

In [67]:
df.iloc[2:5, 2:5]

            food  age  height
Aaron      mango   12     120
Penelope   apple    4      80
Dean      cheese   32     180

In [7]:
df.loc['Jane':'Penelope', ['state', 'color']]

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

In [9]:
df.loc['Jane', 'age']

30

In [10]:
df.iloc[3:6, [1, 4]]

           color  height
Penelope   white      80
Dean        gray     180
Christina  black     172

In [14]:
df.iloc[:, 5]

Jane         4.6
Niko         8.3
Aaron        9.0
Penelope     3.3
Dean         1.8
Christina    9.5
Cornelia     2.2
Name: score, dtype: float64

In [17]:
df['food']

Jane          steak
Niko           lamb
Aaron         mango
Penelope      apple
Dean         cheese
Christina     melon
Cornelia      beans
Name: food, dtype: object

In [18]:
df.loc['Dean':]

          state  color    food  age  height  score
Dean         AK   gray  cheese   32     180    1.8
Christina    TX  black   melon   33     172    9.5
Cornelia     TX    red   beans   69     150    2.2

In [19]:
df.loc[['Dean', 'Cornelia'], ['age', 'state', 'score']]

          age state  score
Dean       32    AK    1.8
Cornelia   69    TX    2.2

In [20]:
df.loc['Jane':'Penelope', ['state', 'color']]

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

In [21]:
df.loc['Jane', 'age']

30

In [22]:
df.iloc[[2,3], [0, 4]]

         state  height
Aaron       FL     120
Penelope    AL      80

In [24]:
df[['food']]

             food
Jane        steak
Niko         lamb
Aaron       mango
Penelope    apple
Dean       cheese
Christina   melon
Cornelia    beans

In [25]:
df['food']

Jane          steak
Niko           lamb
Aaron         mango
Penelope      apple
Dean         cheese
Christina     melon
Cornelia      beans
Name: food, dtype: object